Tekla Open API Reference for Tekla Structures 2025
MainWindow.Frame Field
 The main Tekla Structures window.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static readonly MainWindow Frame
Public Shared ReadOnly Frame As MainWindow
Field Value
Type: MainWindow
See Also
Reference
MainWindow Class
Tekla.Structures.Dialog Namespace